## Objective: 
1. identify the customers who were active in both May and June
2. how did their activity differ between months.

To achieve this, follow these steps:

1. Establish a connection between Python and the Sakila database.

2. Write a Python function called `rentals_month` that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

	- `engine`: an object representing the database connection engine to be used to establish a connection to the Sakila database.
	- `month`: an integer representing the month for which rental data is to be retrieved.
	- `year`: an integer representing the year for which rental data is to be retrieved.

	The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

3. Develop a Python function called `rental_count_month` that takes the DataFrame provided by `rentals_month` as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year. 

	The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".


	*Hint: Consider making use of pandas [groupby()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html)*

4. Create a Python function called `compare_rentals` that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. 
The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [2]:
# A. Establishing a connection between Python and Sakila DB

import os, pymysql

from dotenv import load_dotenv
from sqlalchemy import create_engine, inspect, text, Table, Column, Integer, String, MetaData, ForeignKey

import pandas as pd
import numpy as np
import seaborn as sns

import matplotlib.pyplot as plt
import matplotlib.colors as mcolors

In [3]:
# SQL credentials in .env
load_dotenv()
password = os.getenv('PASSWORD')

# Setting up the engine
bd = 'sakila'
engine = create_engine(f'mysql+pymysql://root:{password}@localhost/{bd}')

In [4]:
def rentals_month(engine, month, year):
    query = text("""
                    SELECT * 
                    FROM rental
                    WHERE Date_format(rental_date, "%M") = :month AND date_format(rental_date, "%Y") = :year
                    """)
        
    result = engine.connect().execute(query, {"month": month, "year":year})
    df = pd.DataFrame(result)
    return df

frame = rentals_month(engine, "June", "2005")
display(frame.head(5))

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,month,weekday,day_type
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2024-10-04 19:15:44,6,Tuesday,workday
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2024-10-04 19:15:44,6,Tuesday,workday
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2024-10-04 19:15:44,6,Tuesday,workday
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2024-10-04 19:15:44,6,Tuesday,workday
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2024-10-04 19:15:44,6,Tuesday,workday

In [5]:

def rental_count_month(df, month, year):
    #  returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year. 
    # include the month and year as parameters and use them to name the new column according to the month and year (like month 05 + year 2005 -> column "rentals_05_2005"
    column_name = ("rentals_" + month + "_" + year)
    
    r = df.groupby("customer_id").size().reset_index(name=column_name)
    
    return r

df2 = rental_count_month(frame, "July", "2005")
display(df2.head(5))

   customer_id  rentals_July_2005
0            1                  7
1            2                  1
2            3                  4
3            4                  6
4            5                  5

In [6]:
def rental_count_month2(month, year, engine=engine):
    #  returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year. 
    # include the month and year as parameters and use them to name the new column according to the month and year (like month 05 + year 2005 -> column "rentals_05_2005"
    df = rentals_month(engine, month, year)
    column_name = ("rentals_" + month + "_" + year)
    
    r = df.groupby("customer_id").size().reset_index(name=column_name)
    
    return r

rental_count_month2("July", "2005")

     customer_id  rentals_July_2005
0              1                 12
1              2                 14
2              3                 13
3              4                  5
4              5                 16
..           ...                ...
594          595                 19
595          596                  6
596          597                  7
597          598                 16
598          599                  7

[599 rows x 2 columns]

In [11]:
def compare_rentals(df1, df2):
    df3 = df1.merge(df2, on="customer_id")
    df3["difference"]= df3.iloc[:,2]-df3.iloc[:,1]
    return df3

df1 = rental_count_month2("June", "2005")
df2 = rental_count_month2("July", "2005")
compare_rentals(df1, df2)

     customer_id  rentals_June_2005  rentals_July_2005  difference
0              1                  7                 12           5
1              2                  1                 14          13
2              3                  4                 13           9
3              4                  6                  5          -1
4              5                  5                 16          11
..           ...                ...                ...         ...
585          595                  2                 19          17
586          596                  2                  6           4
587          597                  3                  7           4
588          598                  1                 16          15
589          599                  4                  7           3

[590 rows x 4 columns]